#Database and SQL Final Project

##Name:
##Partner Name (Optional):

**Make sure to "save" a copy of this file to your own account.**

In this final project, you'll have the chance to design and implement a database using PostgreSQL. You'll be doing the following:


1.	Formulate business rules
2.	Construct an ERD from a set of business rules
3.	Specify the relational schema
4.	Discuss whether this schema meets the 1N, 2N, and 3N normal forms
5.	Create the tables using SQL queries
6.	Run sample SQL queries that demonstrate your ability to

  a.	Create table with primary keys and multiple data types

  b.	Join tables with foreign keys

  c.	Insert sample data into tables

  d.	Update existing data in the table

  e.	Delete data from the table
7.	Run sample SQL queries that demonstrate your ability to do the following:

  a.	Simple single table queries

  b.	Single-table queries with WHERE and LIKE

  c.	Single-table queries with aggregate functions

  d.	Single table queries with GROUP BY

  e.	Single-table queries with HAVING

  f.	Subqueries

  g.	Simple multi-table queries with JOIN

  h.	More complex multi-table queries

  i.	The creation of table views

  j.	The creation of indexes
8.	Discuss your process of database design and implementation using the Software Development LifeCycle Model
9.	Do something unique! You could do ONE of the following, or something else:

  a.	Build some indexes and analyze query performance

  b.	Figure out how to add a JSON column, and insert data

  c.	Write a PL/SQL functions or trigger and show how to use it

  d.	Expand the data model to include subtypes and supertypes

  e.	Let your creativity shine!
10.	Save this project as a portfolio-quality work to Github, which you can then share with me (and with future employers, if you would like).

## Grading
The overall project is worth 100 points, with each of the 10 areas above worth 10 points each.


## Other Guidelines

Here are the guidelines for working on the project:

1. You CAN work with a "team" of up to 3. You should each submit a copy of the work to the D2L dropbox (make sure to include your partner's names!), and each of you should create your own Github account.
2. I encourage you to discuss the project with me (as well as with your peers and tutors). However, my expectation is that the final work done by each team represents their "own" work.

#Load Postgres (Run This Cell)

In [18]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!pip install pgspecial --quiet

!sudo service postgresql start


# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a postgres database with name `my_data` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS my_data;'

!sudo -u postgres psql -U postgres -c 'CREATE DATABASE my_data;'

# Postgres variables
%env DB_NAME=my_data
%env DB_HOST=localhost
%env DB_PORT=5432
%env DB_USER=postgres
%env DB_PASS=postgres

# Finally, let's make a connnection with the databse
%load_ext sql
%sql postgresql://$DB_USER:$DB_PASS@$DB_HOST/$DB_NAME

 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE
ERROR:  database "my_data" is being accessed by other users
DETAIL:  There is 1 other session using the database.
ERROR:  database "my_data" already exists
env: DB_NAME=my_data
env: DB_HOST=localhost
env: DB_PORT=5432
env: DB_USER=postgres
env: DB_PASS=postgres
The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@my_data'

#Part 1: Scenario Analysis and Business Rule Formulation
For the project, you’ll be creating a mock database for “Monster University,” a school that takes young monsters (dragons, werewolves, cute “ET” style aliens, vampires, ogres, talking apes, robot assassins, and basically anything else you want) and teaches them to be upstanding members of the monster community. The professors are ALSO monsters. Here are the business rules you’ll need to get started:

1.	Your main goal is to represent the Monsters, Classes, and Locations (buildings/rooms) at the school.
2.	Monsters can either teach classes, take classes, or both.
3.	For all Monsters we need to keep track of their

  a.	name

  b.	species (what kind of monster are they?)

  c.	date of birth

  d.	their diet, if known (herbivore, carnivore, omnivore, “brains”, “electricity”, etc.)

  e. their GPA (between 0 and 4.0)

  f. the number of credits completed.

4.	For classes, we’d like to track the following:

  a.	The title of the class

  b.	The location in which the class is held

  c.	The duration of the class in minutes (between 30 and 180)

  d.  The days on which the class meets (for example "MWF" or "TH").

  e.  The start time of the class

  f.  The instructor of the class (who is a Monster)


5. For locations we want to record:

  a. A two-character building code (e.g., "MH" for Memorial Hall).

  b. The room number between 1 and 2000.

  c. The max capacity between 10 and 300.

6. Some Monsters are Alumni, who have graduated from the school. For alumni we also want to record:

  a. the year they graduated, and

  b. their degree (computer science, business, English, etc.).

7.	Formulate THREE additional business rules of your choice. Remember, you’ll eventually need to implement these! At least ONE of these rules should involve a new entity, relationship, and/or constraint (as opposed to simply a new attribute).

##Your New Business Rules Here:
1. No two monsters can have the same monster ID.

2. One classroom can have multiple classes.

3. Classes have a credits attribute

#Part 2: Conceptual Modeling using Entity-Relationship Diagramming
In this step, I'd like to create an ERD for the business rules above using [Diagrams.net](https://diagrams.net). You should include all entities, attributes, relationships, and cardinalilities. After you have completed this diagram, you should do the following:

1. Export it as "SVG" file in diagrams.net, and save this to your computer.
2. Edit this cell, and select the "Insert Image" button.
3. Select the SVG file you download.
4. NOTE: SVG files will work much better than larger image files (which may cause problems if you try to insert them).

![Final.svg]()

#Part 3: Logical Modeling
In this part, I'd like you to map the E-R model you've created to a relational model. This involves creating a relational scheme like the following:


```
table_name_1(attribute1 (PK), attribute2, attribute3)
table_name_2(attribute1 (PK), attribute2, attribute3)

```
You should indicate any **primary keys** by using (PK) and any foreign keys with (FK). For primary keys, you'll need to think about whether you can/should use attributes included in the ER diagram, or whether you might want to to create new attributes to serve as keys.

I recommend creating entities in this order:
1. One table for each "strong" entity in the E-R diagram. Decide on a primary key.
2. Tables for subtypes, if needed.
3. One table for each "weak" entity (besides subtypes) in the E-R diagram. Decide on appropriate primary and foreign keys.
4. Tables needed to model M:N relationships present in the E-R diagram.

**PUT YOUR ANSWER BELOW.**

My answer...
```
Monsters(monster_id (PK), species, diet_type, gpa, credits_completed, dob)
Enrollment(monster_id (FK), class_id (FK))
Classes(class_id (PK), instructor_id (FK), title, location (FK), length, class_days, start_time, credits)
Locations(location_id (PK), building_code, room_number, max_capacity)
Alumni(monster_id (PK), grad_year, major)

```

#Part 4: Normalization
Are your relations normalized? Please provide a 2-3 sentence explanation of why/how they meet the following normal forms. Or, if they don't, describe what needs to be done to change them.

1. **First Normal Form.**

Each table has a primary key and has no repeating groups, with all attributes being dependent on the primary key.
2. **Second Normal Form.**

ERD contains no partial dependencies as all of the primary keys are only in one column.
3. **Third Normal Form.**

The tables don't have transitive dependencies and no calculated fields in the ERD

**Revised relational scheme (if needed):**
(Your answer here).

#Part 5: Creating Tables
In this part, you'll be creating the tables to store the data about your monstrous students. This involves "mapping" the relational schema to an actual Postgres Databases. Here's what you need to do:

1. CREATE a SQL table for each of the relations you identied in part 4.
2. Make sure all the attribututes are assigned appropriate data types. For example, INTEGER, VARCHAR, or DATE.
3.  Assign appropriate primary keys and foreign keys.

In the starter code below, I've assumed you'll have tables along the line of the following. However, you should feel free to rename, add, or delete tables as needed!

a. Monsters

b. Classes

c. Locations

d. Monsters2Classes

e. Alumni

In [38]:
%%sql
--If you make mistakes you might need to drop tables and start again
--Here's one way of doing this (run this cell as needed)
DROP TABLE IF EXISTS Monsters CASCADE;
DROP TABLE IF EXISTS Enrollment CASCADE;
DROP TABLE IF EXISTS Classes CASCADE;
DROP TABLE IF EXISTS Locations CASCADE;
DROP TABLE IF EXISTS Alumni CASCADE;

 * postgresql://postgres:***@localhost/my_data
Done.
Done.
Done.
Done.
Done.

[]

In [39]:
%%sql
--Here's the start of one create table statement
--You'll need to create each table individually
--You also need some contraints here!

CREATE TABLE Monsters(
  monster_id int NOT NULL,
  name VARCHAR(32),
  is_teacher VARCHAR(1) CHECK (is_teacher = 'y' OR is_teacher = 'Y' OR is_teacher = 'n' OR is_teacher = 'N'),
  species VARCHAR(32),
  diet_type VARCHAR(32),
  gpa NUMERIC(3,2) CHECK (gpa >= 0.0 AND gpa <= 4.0),
  credits_completed INT,
  dob DATE CHECK (dob <= NOW()),
  PRIMARY KEY (monster_id)
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [40]:
%%sql
CREATE TABLE Locations(
  location_id VARCHAR(6),
  building_code VARCHAR(2),
  room_number INTEGER CHECK (room_number >= 1 AND room_number <= 2000),
  max_capacity INTEGER CHECK (max_capacity = 0 OR (max_capacity >= 10 AND max_capacity <= 300)),
  PRIMARY KEY (location_id)
)


--Create another table, if needed

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [41]:
%%sql
--Create another table, if needed
CREATE TABLE Classes(
  class_id SERIAL,
  instructor_id INT,
  title VARCHAR(64) NOT NULL,
  location VARCHAR(6),
  class_days VARCHAR(8),
  start_time TIME,
  end_time TIME,
  credits INT,
  PRIMARY KEY (class_id),
  FOREIGN KEY (instructor_id) REFERENCES Monsters ON DELETE CASCADE,
  FOREIGN KEY (location) REFERENCES Locations
  
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [42]:
%%sql
--Create another table, if needed
CREATE TABLE Enrollment(
  monster_id INTEGER,
  class_id INTEGER,
  FOREIGN KEY (monster_id) REFERENCES Monsters ON DELETE CASCADE,
  FOREIGN KEY (class_id) REFERENCES Classes
);

 * postgresql://postgres:***@localhost/my_data
Done.

[]

In [43]:
%%sql
--Create another table, if needed
CREATE TABLE Alumni(
  monster_id INTEGER,
  grad_year INTEGER,
  major VARCHAR(64),
  PRIMARY KEY (monster_id)
)

 * postgresql://postgres:***@localhost/my_data
Done.

[]

#Part 6: Retrieving, Updating, and Deleting Data
In this part, you'll be inserting some data about Monsters, Classes, and Locations.

##6b. Inserting Data
Here are five monsters to insert your database:

1. Cookie Monster (unknown species) was born on Nov 10, 1969. His eats only cookies. He has 3.2 GPA and has completed 76 credits.
2. Marceline (vampire) was born in Feb 3, 1056. She eats "the color red". She is a teacher with a 0.0 GPA and 0 credits completed.
3. Chewbacca (wookie) was born on May 25, 1977. He is an omnivore. He has a 2.6 GPA and has completed 24 credits.
4. Dracula (vampire) was born on Aug 15, 1543. He drinks blood. He has a 4.0 GPA with 112 credits completed. He also teachers classes.
5. Maleficient (dragon) was born on Oct 26, 1856. She is a carnviore. She has a 3.8 GPA with 63 credits completed.
6. Insert at least FOUR more monsters of your choice. At least two of these should have the same species.

Now, show the data in the table.

Here are three locations to insert into your database:
1. CL 101 ("Castle level 1, room 1") holds 100 people.
2. CL 503 ("Castle level 5, room 3") holds 34 people.
3. MU 220 ("Monster Union room 220") holds 12 people.
4. Insert at least TWO more locations into your database. Both should be in the same building.

Now, show the data in the table.


Here are two classes to insert into your database:
1. Marceline teaches Intro to Guitar on TH from 2 PM to 4 PM in MU 220.
2. Dracula teaches Monster First Aid on MWF from 9 PM to 10 PM in CL 503.
2. Insert at least ONE more class.

Now, show the data in the table.


"ENROLL" some students in your classes.
1. Cookie Monster, Chewbacca, and Maleficient (and perhaps some of the students you added) will take Monster First Aid.
2. Chewbacca and Malificient (and perhaps some of the students you added) will take Intro to Guitar.
3. Enroll some students in your own class!
Now, show the data in the table.


Finally, insert data for at least ONE alumni, and show the results.

In [44]:
%%sql
-- If you make mistakes, you might need to delete existing data from your tables.
-- One way you might do this is as follows
-- You might need to include different table names!

DELETE FROM Monsters CASCADE;
DELETE FROM Locations CASCADE;
DELETE FROM Classes CASCADE;
DELETE FROM Alumni CASCADE;
DELETE FROM Enrollment CASCADE;

 * postgresql://postgres:***@localhost/my_data
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [45]:
%%sql
--- Insert the data on Monsters. You'll be using statements like the following:
--INSERT INTO Monsters(id, name, ...) VALUES (1, 'Cookie Monster', ...);

--When you are done inserting, you should display the data, like so:
--SELECT * FROM Monsters;
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (1, 'Cookie Monster', 'n', 'Unknown', 'cookies', 3.2, 76, '1969-11-10');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (2, 'Marceline', 'y', 'vampire', 'the color red', 0.0, 0, '1056-02-03');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (3, 'Chewbacca', 'n', 'wookie', 'omnivore', 2.6, 24, '1977-05-25');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (4, 'Dracula', 'y', 'vampire', 'blood', 4.0, 112, '1543-08-15');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (5, 'Maleficent', 'n', 'dragon', 'carnivore', 3.8, 63, '1856-10-26');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (6, 'Herobrine', 'n', 'humanoid', 'omnivore', 3.2, 29, '2009-05-17');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (7, 'The Joker','y', 'human', 'omnivore', 3.6, 15, '1940-04-25');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (8, 'Frankenstein', 'n', 'undead', 'carnivore', 2.9, 22, '1818-01-01');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (9, 'Cthulhu', 'y', 'aquatic', 'carnivore', 3.9, 15, '1934-05-11');
INSERT INTO Monsters(monster_id, name, is_teacher, species, diet_type, gpa, credits_completed, dob)
VALUES (10, 'Mike Wazowski', 'n', 'cyclops', 'omnivore', 3.6, 84, '1985-02-15');
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
10 rows affected.

[(1, 'Cookie Monster', 'n', 'Unknown', 'cookies', Decimal('3.20'), 76, datetime.date(1969, 11, 10)),
 (2, 'Marceline', 'y', 'vampire', 'the color red', Decimal('0.00'), 0, datetime.date(1056, 2, 3)),
 (3, 'Chewbacca', 'n', 'wookie', 'omnivore', Decimal('2.60'), 24, datetime.date(1977, 5, 25)),
 (4, 'Dracula', 'y', 'vampire', 'blood', Decimal('4.00'), 112, datetime.date(1543, 8, 15)),
 (5, 'Maleficent', 'n', 'dragon', 'carnivore', Decimal('3.80'), 63, datetime.date(1856, 10, 26)),
 (6, 'Herobrine', 'n', 'humanoid', 'omnivore', Decimal('3.20'), 29, datetime.date(2009, 5, 17)),
 (7, 'The Joker', 'y', 'human', 'omnivore', Decimal('3.60'), 15, datetime.date(1940, 4, 25)),
 (8, 'Frankenstein', 'n', 'undead', 'carnivore', Decimal('2.90'), 22, datetime.date(1818, 1, 1)),
 (9, 'Cthulhu', 'y', 'aquatic', 'carnivore', Decimal('3.90'), 15, datetime.date(1934, 5, 11)),
 (10, 'Mike Wazowski', 'n', 'cyclops', 'omnivore', Decimal('3.60'), 84, datetime.date(1985, 2, 15))]

In [ ]:
%%sql
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[(1, 'Cookie Monster', 'n', 'Unknown', 'cookies', Decimal('3.20'), 76, datetime.date(1969, 11, 10)),
 (2, 'Marceline', 'y', 'vampire', 'the color red', Decimal('0.00'), 0, datetime.date(1056, 2, 3)),
 (3, 'Chewbacca', 'n', 'wookie', 'omnivore', Decimal('2.60'), 24, datetime.date(1977, 5, 25)),
 (4, 'Dracula', 'y', 'vampire', 'blood', Decimal('4.00'), 112, datetime.date(1543, 8, 15)),
 (5, 'Maleficent', 'n', 'dragon', 'carnivore', Decimal('3.80'), 63, datetime.date(1856, 10, 26)),
 (6, 'Herobrine', 'n', 'humanoid', 'omnivore', Decimal('3.20'), 29, datetime.date(2009, 5, 17)),
 (7, 'The Joker', 'y', 'human', 'omnivore', Decimal('3.60'), 15, datetime.date(1940, 4, 25)),
 (8, 'Frankenstein', 'n', 'undead', 'carnivore', Decimal('2.90'), 22, datetime.date(1818, 1, 1)),
 (9, 'Cthulhu', 'y', 'aquatic', 'carnivore', Decimal('3.90'), 15, datetime.date(1934, 5, 11)),
 (10, 'Mike Wazowski', 'n', 'cyclops', 'omnivore', Decimal('3.60'), 84, datetime.date(1985, 2, 15))]

In [46]:
%%sql
--Insert the data on locations, and show the results
INSERT INTO Locations(location_id, building_code, room_number, max_capacity)
VALUES('CL101', 'CL', 101, 100);
INSERT INTO Locations(location_id, building_code, room_number, max_capacity)
VALUES('CL503', 'CL', 503, 34);
INSERT INTO Locations(location_id, building_code, room_number, max_capacity)
VALUES('MU220', 'MU', 220, 12);
INSERT INTO Locations(location_id, building_code, room_number, max_capacity)
VALUES('CB370', 'CB', 370, 115);
INSERT INTO Locations(location_id, building_code, room_number, max_capacity)
VALUES('CB215', 'CB', 215, 40);
SELECT * FROM Locations;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[('CL101', 'CL', 101, 100),
 ('CL503', 'CL', 503, 34),
 ('MU220', 'MU', 220, 12),
 ('CB370', 'CB', 370, 115),
 ('CB215', 'CB', 215, 40)]

In [47]:
%%sql
--Insert the data on classes, and show the results
INSERT INTO Classes(class_id, instructor_id, title, location, class_days, start_time, end_time, credits)
VALUES(1, 2, 'Intro to Guitar', 'MU220', 'Th', '14:00:00', '16:00:00', 3);
INSERT INTO Classes(class_id, instructor_id, title, location, class_days, start_time, end_time, credits)
VALUES(2, 4, 'Monster First Aid', 'CL503', 'MWF', '21:00:00', '22:00:00', 4);
INSERT INTO Classes(class_id, instructor_id, title, location, class_days, start_time, end_time, credits)
VALUES(3, 7, 'Causing Havoc', 'CB370', 'TTh', '15:00:00', '18:00:00', 3);
SELECT * FROM Classes;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(1, 2, 'Intro to Guitar', 'MU220', 'Th', datetime.time(14, 0), datetime.time(16, 0), 3),
 (2, 4, 'Monster First Aid', 'CL503', 'MWF', datetime.time(21, 0), datetime.time(22, 0), 4),
 (3, 7, 'Causing Havoc', 'CB370', 'TTh', datetime.time(15, 0), datetime.time(18, 0), 3)]

In [48]:
%%sql
--Insert the alumni data, and show the results
INSERT INTO Alumni(monster_id, grad_year, major)
VALUES(10, 2002, 'Comedy');
SELECT * FROM Alumni;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.

[(10, 2002, 'Comedy')]

In [49]:
%%sql
--Insert the enrollment data, and show the results
INSERT INTO Enrollment(monster_id, class_id)
VALUES(1, 2);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(3, 2);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(5, 2);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(3, 1);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(5, 1);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(5, 3);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(9, 3);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(8, 1);
INSERT INTO Enrollment(monster_id, class_id)
VALUES(8, 3);
SELECT * FROM Enrollment;

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
9 rows affected.
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: --Insert the enrollment data, and show the results]
(Background on this error at: https://sqlalche.me/e/14/f405)

#6c: Updating Data
In this section, I'd like you to run the following updates

1. MU 220 has been expanded! It can now hold 25 students, instead of 12.
2. Another semester has passed. Add 12 credits to each student's record.
3. One of the rooms is closed for the semester due to construction

After each update please SELECT from the table to show the results.

In [50]:
%%sql
--Update MU 220 and show results
UPDATE Locations
SET max_capacity = 25
WHERE location_id = 'MU220';
SELECT * FROM Locations
WHERE location_id = 'MU220';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.

[('MU220', 'MU', 220, 25)]

In [51]:
%%sql
UPDATE Monsters
SET credits_completed = credits_completed + 12
WHERE is_teacher = 'n' OR is_teacher = 'N';
SELECT * FROM Monsters;

 * postgresql://postgres:***@localhost/my_data
6 rows affected.
10 rows affected.

[(2, 'Marceline', 'y', 'vampire', 'the color red', Decimal('0.00'), 0, datetime.date(1056, 2, 3)),
 (4, 'Dracula', 'y', 'vampire', 'blood', Decimal('4.00'), 112, datetime.date(1543, 8, 15)),
 (7, 'The Joker', 'y', 'human', 'omnivore', Decimal('3.60'), 15, datetime.date(1940, 4, 25)),
 (9, 'Cthulhu', 'y', 'aquatic', 'carnivore', Decimal('3.90'), 15, datetime.date(1934, 5, 11)),
 (1, 'Cookie Monster', 'n', 'Unknown', 'cookies', Decimal('3.20'), 88, datetime.date(1969, 11, 10)),
 (3, 'Chewbacca', 'n', 'wookie', 'omnivore', Decimal('2.60'), 36, datetime.date(1977, 5, 25)),
 (5, 'Maleficent', 'n', 'dragon', 'carnivore', Decimal('3.80'), 75, datetime.date(1856, 10, 26)),
 (6, 'Herobrine', 'n', 'humanoid', 'omnivore', Decimal('3.20'), 41, datetime.date(2009, 5, 17)),
 (8, 'Frankenstein', 'n', 'undead', 'carnivore', Decimal('2.90'), 34, datetime.date(1818, 1, 1)),
 (10, 'Mike Wazowski', 'n', 'cyclops', 'omnivore', Decimal('3.60'), 96, datetime.date(1985, 2, 15))]

In [52]:
%%sql
--An update of your choice and show the results
UPDATE Locations
SET max_capacity = 0
WHERE location_id = 'CB215';

SELECT * FROM Locations
WHERE location_id = 'CB215';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.
1 rows affected.

[('CB215', 'CB', 215, 0)]

#Part 7: SQL Queries
In this section, you'll be demonstrating your ability to retrieve data from the database you've created using SQL queries.

##7a: Simple Single table queries
Retreive a list of monsters ordered alphabetically by name. Limit your results to 5.

In [53]:
%%sql
-- 7a
SELECT * FROM Monsters
ORDER BY name
LIMIT 5;

 * postgresql://postgres:***@localhost/my_data
5 rows affected.

[(3, 'Chewbacca', 'n', 'wookie', 'omnivore', Decimal('2.60'), 36, datetime.date(1977, 5, 25)),
 (1, 'Cookie Monster', 'n', 'Unknown', 'cookies', Decimal('3.20'), 88, datetime.date(1969, 11, 10)),
 (9, 'Cthulhu', 'y', 'aquatic', 'carnivore', Decimal('3.90'), 15, datetime.date(1934, 5, 11)),
 (4, 'Dracula', 'y', 'vampire', 'blood', Decimal('4.00'), 112, datetime.date(1543, 8, 15)),
 (8, 'Frankenstein', 'n', 'undead', 'carnivore', Decimal('2.90'), 34, datetime.date(1818, 1, 1))]

##7b. Single-table queries with WHERE and LIKE
Retrieve JUST the classes that meet on Wednesday (where Wednesday is the 'W' in strings like 'MWF').

In [54]:
%%sql
-- 7b
SELECT * FROM Classes
WHERE class_days LIKE '%W%';

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(2, 4, 'Monster First Aid', 'CL503', 'MWF', datetime.time(21, 0), datetime.time(22, 0), 4)]

##7c. Single-table queries with aggregate functions
Retrieve the minimum, maximum, and average GPA included in your database. You should label the columns "Min GPA", "Max GPA", and "Avg GPA".

In [56]:
%%sql
--7c
SELECT MIN(gpa) AS "Min GPA", MAX(gpa) AS "Max GPA", ROUND(AVG(gpa), 2) AS "Avg GPA"
FROM Monsters

 * postgresql://postgres:***@localhost/my_data
1 rows affected.

[(Decimal('0.00'), Decimal('4.00'), Decimal('3.08'))]

##7d. Single table queries with GROUP BY
Retrieve a list of each monster species included in the database, along with a count of how many monsters are members of the species.

In [59]:
%%sql
--7d
SELECT species, COUNT(species)
FROM Monsters
GROUP BY species;

 * postgresql://postgres:***@localhost/my_data
9 rows affected.

[('dragon', 1),
 ('Unknown', 1),
 ('cyclops', 1),
 ('undead', 1),
 ('wookie', 1),
 ('humanoid', 1),
 ('human', 1),
 ('vampire', 2),
 ('aquatic', 1)]

##7e. Single-table queries with HAVING
Retrieve a list of the buildings (not rooms!) in your data that have a total capacity of more than 20. (A building's capacity is simply the sum of the capacities of all the classrooms it contains).

In [67]:
%%sql
--7e
SELECT building_code, SUM(max_capacity) AS "Sum"
FROM Locations
GROUP BY building_code
HAVING SUM(max_capacity) > 20;

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[('CL', 134), ('MU', 25), ('CB', 115)]

##7f. Subqueries
Retrieve a list of monsters names and species, together with a count of how many members of that species are in the database.

In [71]:
%%sql
-- 7f NOTE i can't remember how to do this
SELECT name, species, COUNT(species)
FROM Monsters
GROUP BY species, name

 * postgresql://postgres:***@localhost/my_data
10 rows affected.

[('Chewbacca', 'wookie', 1),
 ('The Joker', 'human', 1),
 ('Maleficent', 'dragon', 1),
 ('Frankenstein', 'undead', 1),
 ('Cookie Monster', 'Unknown', 1),
 ('Dracula', 'vampire', 1),
 ('Marceline', 'vampire', 1),
 ('Cthulhu', 'aquatic', 1),
 ('Herobrine', 'humanoid', 1),
 ('Mike Wazowski', 'cyclops', 1)]

#7g. Simple multi-table queries with JOIN
Retrieve the names and GPAs of students enrolled in Intro to Guitar.

In [78]:
%%sql
-- 7g
SELECT Monsters.name, monsters.gpa
FROM Monsters, Enrollment, Classes
WHERE Monsters.monster_id = Enrollment.monster_id AND Enrollment.class_id = Classes.class_id AND Classes.title LIKE 'Intro to Guitar';

 * postgresql://postgres:***@localhost/my_data
3 rows affected.

[('Chewbacca', Decimal('2.60')),
 ('Maleficent', Decimal('3.80')),
 ('Frankenstein', Decimal('2.90'))]

##7h. More complex multi-table queries
Retrieve the total students taught by each teacher in the database. You should have one row of output for each teacher with their name and the total number of students.

In [ ]:
%%sql
-- 7h
SELECT Monster.name,

##7i. Creation of Views
Create a VIEW based on a SQL query of your choice. Now "SELECT *" from this view to show the results.

In [ ]:
%%sql
-- 7i

##7g. Creation of Indexes.
Create an index on the column that contains the Monster's names.

In [ ]:
%%sql
-- 7f

#8. Database Design Philosophy
In 150 to 200 words, answer the question **"What are the keys to designing a successful database, and how is this reflected in your own work here?"**


A successful database follows a few key features.  One such example is minimizing data redundancy and dependencies.  Use of public and foreign keys may help with connecting tables together easily in queries.  Another thing that may help is naming the tables in a way that makes sense (i.e. not naming a table that contains customer data as "data" with no explaination in the name.) Avoiding Many to Many relationships can be done by creating new tables like I did when I used the Enrollment table to make it easier to make joining tables together easier.

#9. Be Creative!
In 150 to 200 words, tell me about what you've done (or will do, in this section) that goes above and beyond the "requirements" of the assignment. Why did you choose to do this? What did you learn from doing it?

YOUR ANSWER HERE.

(Feel free to add code cells below if needed.)

In [ ]:
%%sql
-- Include code, if needed.

#10. Share Work With Me on Github
Finally, I'd like you to share your work with me on Github. If you are interesting in working in computer science or IT, it's good to have a basic understanding of how Github works, as its something like an industry "standard" way of sharing code.

Here's what you need to do:
1. Create an account on https://github.com/
2. Create a PUBLIC repository called "database_sql".
3. Save your **completed** lab to this repository. From colab, all you need to do is go to "File: Save a copy in Github."

An in-depth tutorial on using Github is here:
https://docs.github.com/en/get-started/quickstart/hello-world
The only things you need to worry about are (a) creating an account and (b) creating a repository. We won't be worry about branches, commits, or pulls (though you are free to read up on these!).

Once you've done this, please write down your:

USERNAME: TheJoaster

REPOSITORY LINK: https://github.com/TheJoaster/database_sql

And that's it! I've enjoyed having you in class--enjoy the rest of the semster :).

**You should also submit this to the D2L Assignment folder.**